u5197140705-commits/dbus_porting_BA/ozone/variant_mkv56f1/svd/MKV56F24.xml
        <register>
          <name>SEL1</name>
          <description>Crossbar B Select Register 1</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SEL2</name>
              <description>Input (XBARB_INn) to be muxed to XBARB_OUT2 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CMP0 Output</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CMP1 Output</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>CMP2 Output</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>CMP3 Output</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>FTM0 all channels match trigger ORed together</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>FTM0 counter init trigger</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>FTM3 all channels match trigger ORed together</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>FTM3 counter init trigger</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>PWMA channel 0 trigger 0</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>PWMA channel 1 trigger 0</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PWMA channel 2 trigger 0</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>PWMA channel 3 trigger 0</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>PDB0 channel 0 output trigger</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion A complete</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>XB_IN2 input pin</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>XB_IN3 input pin</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>FTM1 all channels match trigger ORed together</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>FTM1 counter init trigger</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>DMA channel 0 done</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>DMA channel 1 done</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>XB_IN10 input pin</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>XB_IN11 input pin</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>DMA channel 6 done</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>DMA channel 7 done</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>PIT trigger 0</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>PIT trigger 1</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>PDB1 channel 0 output trigger</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion B complete</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>PWMB channel 0 trigger 0 or trigger 1</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>PWMB channel 1 trigger 0 or trigger 1</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>PWMB channel 2 trigger 0 or trigger 1</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>PWMB channel 3 trigger 0 or trigger 1</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>FTM2 all channels match trigger ORed together</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>FTM2 counter init trigger</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>PDB0 channel 1 output trigger</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>35</name>
                  <description>PDB1 channel 1 output trigger</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion A complete</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion B complete</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>Analog-to-Digital Converter 0 conversion complete</description>
                  <value>#100110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL3</name>
              <description>Input (XBARB_INn) to be muxed to XBARB_OUT3 (refer to Functional Description section for input/output assignment)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>CMP0 Output</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CMP1 Output</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>CMP2 Output</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>CMP3 Output</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>FTM0 all channels match trigger ORed together</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>FTM0 counter init trigger</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>FTM3 all channels match trigger ORed together</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>FTM3 counter init trigger</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>PWMA channel 0 trigger 0</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9</name>
                  <description>PWMA channel 1 trigger 0</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PWMA channel 2 trigger 0</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>PWMA channel 3 trigger 0</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>PDB0 channel 0 output trigger</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion A complete</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>XB_IN2 input pin</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>XB_IN3 input pin</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>FTM1 all channels match trigger ORed together</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>FTM1 counter init trigger</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>DMA channel 0 done</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>DMA channel 1 done</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>XB_IN10 input pin</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>XB_IN11 input pin</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>DMA channel 6 done</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>DMA channel 7 done</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>PIT trigger 0</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>PIT trigger 1</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>PDB1 channel 0 output trigger</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>High Speed Analog-to-Digital Converter 0 conversion B complete</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>PWMB channel 0 trigger 0 or trigger 1</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>PWMB channel 1 trigger 0 or trigger 1</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>PWMB channel 2 trigger 0 or trigger 1</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>PWMB channel 3 trigger 0 or trigger 1</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>FTM2 all channels match trigger ORed together</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>FTM2 counter init trigger</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>PDB0 channel 1 output trigger</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>35</name>
                  <description>PDB1 channel 1 output trigger</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion A complete</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>High Speed Analog-to-Digital Converter 1 conversion B complete</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>Analog-to-Digital Converter 0 conversion complete</description>
                  <value>#100110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
